# 1) კომენტარების სახით ახსენით თუ რას აკეთებს .upper(), .lower() ფუნქციები.

# 2) მომხმარებელს შემოატანინეთ თავისი სახელი. თქვენი დავალებაა მომხმარებელს ეს სახელი დაუბეჭდოთ მაღალ (upper) და დაბალ (lower) რეგისტრებში.

# 3) მოცემულია რიცხვების სია. გამოიყენეთ slicing, რომ ამოიღოთ სიიდან ყოველი მეორე რიცხვი.
# -- numbers = [10, 20, 30, 40, 50, 60, 70] --

#პასუხები-----------------

# 1)
# .upper() ფუნქცია ტექსტის ყველა ასოს მაღლად აქცევს, ანუ დიდ ასოებად.
# .lower() ფუნქცია ტექსტის ყველა ასოს პატარად აქცევს, ანუ პატარა ასოებად.


# 2)
name = input("შეიყვანეთ თქვენი სახელი: ")

print("დიდი ასოებით:", name.upper())
print("პატარა ასოებით:", name.lower())


# 3)
numbers = [10, 20, 30, 40, 50, 60, 70]

every_second = numbers[::2]

print(every_second)