# 1)კომენტარების სახით ახსენით თუ რაარის ფუნქცია და რაში ვიყენებთ მას ასევე ახსენით თუ რაარის built in function და მოიყვანეთ მაგალითი
# 2)კომენტარების სახით ახსენით თუ რეებია და რასაკეთებენ .upper(), .lower(), .capitalize() ები
# 4)კომენტარების სახით ახსენით თუ რაარის ინდექსი და რაში გვეხმარება ის
# 5)შექმენით 7 ელემენტიანი სახელების სია, შეცვალეთ 1-ლი და მე-5 ინდექსზე მდგომი ელემენტების მნიშვნელობა
# 6) კომენტარებით ახსენით ასევე განსხვავება list-ს და ცვლადს შორის.
# 7)კომენტარების სახით ახსენით თუ რაარის drop down menus 
# 8)გააკეთეთ ჩამოსაშლელი მენიუს მაგალითი სადაც მომხმარებელს შეეძლება რომ ამოირჩიოს 10 ქვეყანა
# 9)კომენტარების სახით ახსენით თუ რაარის video tag და რაში ვიყენებთ მას
# 10)შექმენით მრავალგვერდიანი საიტი სადაც გექნებათ ერთი გვერდი რეგისტრაციისთვის მეორე გვერდი ჩვენს შესახებ და მესამე გვერდზე უკვე გამოიტანთ 
# ინფორმაციას ან რაც თქვენ გინდათ საიტზე აუცილებლად უნდა იყოს მინიმუმ 3 ფოტო და 3 ვიდეო და უნდა იყოს გაფორმებული ლამზი ტექტსებითა და ტეგებით

#პასუხები----------------------

# 1) ფუნქცია არის კოდის ბლოკი, რომელიც ასრულებს გარკვეულ დავალებებს ჩვენი მიცემული არგუმენტის მიხედვით, built in function არის ფუნცია, 
# რომელიც არის ჩაშენებული პროგრამაში
# 2) .lowercase() ტექსტს აპატარავებს, ხოლო .uppercase ტექსტს ადიდებს
# 4) სიის მისამაართი
# 6) list არის სია, რომელიც შედგება ელემენტებისაგან, სიიდან შეგვიძლია შევასრულოთ სხვადასხვა პროცესები, მაგალითად ჩავანაცვლოთ ელემენტები 
# ან შევცვალოთ ისისნი, მაგრამ ცვლადში, მხოლოდ ერთი პირობა თავსდება
