# 1)კომენტარების სახით ახსენით თუ რაარის ფუნქცია და რაში ვიყენებთ მას ასევე ახსენით თუ რაარის built in function და მოიყვანეთ მაგალითი
# 2)კომენტარების სახით ახსენით თუ რეებია და რასაკეთებენ .upper(), .lower(), .capitalize() ები
# 4)კომენტარების სახით ახსენით თუ რაარის ინდექსი და რაში გვეხმარება ის
# 6) კომენტარებით ახსენით ასევე განსხვავება list-ს და ცვლადს შორის.


#პასუხები----------------------

# 1) ფუნქცია არის კოდის ბლოკი, რომელიც ასრულებს გარკვეულ დავალებებს ჩვენი მიცემული არგუმენტის მიხედვით, built in function არის ფუნცია, 
# რომელიც არის ჩაშენებული პროგრამაში
# 2) .lowercase() ტექსტს აპატარავებს, ხოლო .uppercase ტექსტს ადიდებს, capitalize() ადიდებს პირველ ასოს
# 4) ელემენტის მისამაართი
# 6) list არის სია, რომელიც შედგება ელემენტებისაგან, სიიდან შეგვიძლია შევასრულოთ სხვადასხვა პროცესები, მაგალითად ჩავანაცვლოთ ელემენტები 
# ან შევცვალოთ ისისნი, მაგრამ ცვლადში, მხოლოდ ერთი პირობა თავსდება
