# 2) დაატრიალეთ for ციკლი 0 დან 38 ის ჩათვლით და გამოიტანე თითოეული რიცხვი ტერმინალში 

# 3) დაატრილეთ for ციკლი 30 დან 40 მდე და გამოიტანე თითოეული რიცხვი ტერმინალში
 
# 4) დაატრიალეთ for ციკლი 12 იდან 120 მდე და გამოიტანე თითოეული რიცხვი ტერმინალში

# 5) დაატრიალეთ for ციკლი და გამოიტანეთ თქვენი სახელი 18 ჯერ.

# 6) დაატრიალეთ for ციკლი 10 დან 100 მდე 3 step ის გამოტოვებით და გამოიტანეთ თითოეული რიცხვი ტერმინალში

# 7) ტერმინალში გამოიტანეთ თქვენი საყვარელი ხილის სახელი 30 ჯერ და თან დანომრეთ, მიიღეთ ქვემოთ მოცემულის ნაირი შედეგი

# 1 ფორთოხალი
# 2 ფორთოხალი
# 3 ფორთოხალი
# 4 ფორთოხალი
# 5 ფორთოხალი
# .... 
# ....
# ....
# 30 ფორთოხალი

# 7) მომხმარებელს შემოატანინეთ მისი ასაკი 13 ჯერ გამოიყენე for loop

# 8) გამოიტანეთ თქვენი სახელი 10 ჯერ while loop ის გამოყენებით

# 9) დაითვალეთ 0 დან 24 მდე გამოიყენეთ while loop

# 10) იმუშაოვეთ ბევრი for და while loop ებზე მოიყვანეთ თქვენით მაგალითები სურვილისამებრ

#პასუხები--------------

#2)

for i in range(0, 39):
    print(i)

#3)

for i in range(30, 40):
    print(i)

#4)

for i in range(12, 120):
    print(i)

#5)

for i in range(18):
    print("Saba") 

#6)

for i in range(10, 101, 3):
    print(i)

#7)

for i in range(1, 31):
    print(i, "ფორთოხალი")

#8)

for i in range(13):
    age = input("insert your age here: ")

#9)

i = 0
while i < 10:
    print("Saba")  
    i += 1