# 1) კომენტარების სახით ახსენით თუ რა დანიშნულება აქვთ .append(); .insert() და .pop() ფუნქციებს
# 2) კომენტარებით ახსენით თუ რა არის custom ფუნქციები, და რისთვის გამოვიყენებთ მათ
# 3)მოცემულია სია food= ["grape", "apple", "peach", "carrot"]
# თქვენი დავალებაა insert() მეთოდით ჩასვათ სიტყვა "onion" სიაში მეორე პოზიციაზე, რის შემდეგაც დაბეჭდავთ განახლებულ სიას
# 4)გადმოგეცემათ სია colors = ["red", "green", "blue", "yellow", "purple"] თქვენი დავალებაა სიიდან წაშალოთ ბოლო ელემენტი pop() გამოყენებით და შემდგომ დააბრუნოთ განახლებული სია
# 5)გადმოგეცემათ სია numbers= [5,10,15,20,25] თქვენი დავალებაა რომ ამ სიის ბოლო დაამატოტ 30 .append() ის გამოყენებით
# 6)კომენტარების სახით ახსენით თუ რაარის  .lower() და .upper() და ასევე გააკეთეთ 2-2 მაგალითი მათი გამოყენებით
# 7)შექმენით ფუნქცია, რომელსაც გადაეცემა 1 რიცხვი. თქვენი დავალებაა შეამოწმოთ ამ რიცხვის ლუწობა. თუ იგი ლუწია, დაბეჭდეთ "რიცხვი ლუწია" სხვა შემთხვევაში "რიცხვი კენტია"
# 8)კომენტარების საშუალებით ახსენით რამდენი სახის css იცით და რა განსხვავებაა მათ შორის
# 9)კომენტარების სახით ახსენით თუ რაგანსხვავებაა class და id შორის
# 10)external css - ის გამოყენებით გასტილეთ 5 h2 და 5 p თეგები თქვენთვის სასურველ ფერებში და თქვენი სურვილისამებრ მაგრამ ყველას უნდა ჰქონდეს სხვადასხვა ნაირი სტილი
# 11)კომენტარების სახით ახსენით რა არის RGB პალიტრა და HEX კოდების სისტემა
# 12)შექმენით 5 h1 და გასტილეთ 5 ივე სხვადასხვა ფერით აუცილებლად გამოიყენეთ RGB
# 13)კომენტარების სახით რა არის pseudo-selectors და რაში ვიყენებთ მათ
# 14)გააკეთეთ 1-1 მაგალითიიმ pseudo selector ებზე (რაც გაიარეთ ჯგუფში იმათზე)
# 15) შექმენით მცირე ვებ-საიტი თქვენი საყვარელი სპორტის შესახებ გამოიყენეთ აგანვლილი მასალა:(styling links & font styles 

# პასუხები-------------- 

# 1) .append()- ვიყენებთ მაშინ როდესაც გვინდა რომ სიის ბოლოში ელემენტი ჩავამატოთ 
#     .insert()- ვიყენებთ მაშინ როდესაც გვინდა რომ სიაშ ელემენტი კონკრეტულ ადგილას ჩავამატოთ
#     .pop()- ვიყენებთ მაშნ როდესაც გვინდა რომ სიის კონკრეტული ელემნტი ამოვიღოთ, თუ ელემენტის ინდექსი არ არის სპეციფირებული, მაშინ ბოლო ელემენტს იღებს

# 2) costum ფუნქციები არის ჩვენ მიერ შექმილი ფუნქციები, ისინი იქმნებიან key word def-ით, მათ ვიყენებთ კოდის ადვილად და მოკლედ დასაწერად

# 3)
food = ["grape", "apple", "peach", "carrot"] 
food.insert(1, "onion")

print(food)
# 4) 
colors = ["red", "green", "blue", "yellow", "purple"]
colors.pop()

print(colors)
# 5)
numbers= [5,10,15,20,25]
numbers.append(30)

print(numbers)

# 6) .lower() ფუნქცია, ყველა ასოს აპატარავებს
#    .upper() ფუნქცია, ყველა ასოს ადიდებს

print("GOA".lower())
print("goa".upper())

# 7) 
def check_numbers(number):
    if number % 2 == 0:
      print("ლუწია")
    else:
       print("კენტია")


# 8) ჩვენ გვაქვს სამი სახის css: inline, internal, external
# inline იწერება პირდაპირ ტეგებში, internal იწერება <style> ტეგის გამოყენებთ, ხოლო external css არის დაკავშირებული ლინკის მეშვეობით HTML-ის ფაილთან

# 9) class - კრებს ბევრ სხვადასხვა ელემენტს ერთად, რის შემდეგაც შეგვიძლია ერთზე მეტ ელემენტებზე ერთად მუშაობა, class შეგვიძლია მივწევდეთ .-ით
#    id - ეხება მხოლოდ ერთ ელემენტს, id-ით უფრო კონკრეტულად შეიძლება ელემენტის გასტილვა, id-ს შეგვიძლია მივწვდეთ #-ით

# 11) RGB - განიმარტება როგორც: Red, Green, Blue. RGB-ის ყოველ ფერს აქვს 0-255 მონაცემი, რაც უფრო დიდი რიცხვია, მით უფრო დიდი კონცენტრაცია ამ ფერის 
#     HEX - იგი, იყენებს 6 ასოს ან რიცხვს, A-F და 0-9

# 13) pseudo selector - ები აადვილებენ HTML-ის ელემენტების გასტილვას
#     მაგალითად:
#     :hover - როდესაც მაუსს მივუახლოვებთ ამით გასტილულ ელემნტს, ის შეიცვლება
#     :first-child - ირჩევს იმ ელემნტს რომელიც მშობელი ელემნტის პირველი შვილია

check_numbers(10)