# 2) კომენტარების სახით თქვენი სიტყვებით ახსენით ყველა მონაცემთა ტიპი (string, integer, float)

# 3) კომენტარების სახით თქვენი სიტყვებით ახსენით რა არის ცვლადი და რაში ვიყენებთ მათ.

# 4) print() ფუნქციის დახმარებით დაბეჭდეთ 5 string ტიპის მნიშნელობა, 5 integer ტიპის მნიშვნელობა, 5 float ტიპის მნიშვნელობა.

# 5) შექმენით 5 სხვადასხვა ცვლადი. ცვლადებში შეინახეთ თქვენთვის სასურველი მნიშვნელობები და შემდეგ დაბეჭდეთ ერთი დიდი წინადადება ერთი print() ფუნქციის მეშვეობით.

# 6) გააკეთეთ 3-3 მაგალითი ყველა მათემატიკურ ოპერაციებზე.

# 7) შექმენით სამი ცვლადი num1, num2 და num3, შემდეგ კი დაპრინტეთ მათი ჯამი termian-ში.

# 2) კომენტარების სახით თქვენი სიტყვებით ახსენით ყველა მონაცემთა ტიპი (string, integer, float)
# სტრინგი არის ის მონაცემთა ტიპი, რომელიც წარმოდგენილია ""
# ინტეგერი არის მთელი რიცხვი (10)
# ფლოუთი არის ათწილადი (5.5)

#3) კომენტარების სახით თქვენი სიტყვებით ახსენით რა არის ცვლადი და რაში ვიყენებთ მათ.
# არის ყუთი, რომელშიც შეგვიძლია შევინახოთ ინფორმაცია

# 4) print() ფუნქციის დახმარებით დაბეჭდეთ 5 string ტიპის მნიშნელობა, 5 integer ტიპის მნიშვნელობა, 5 float ტიპის მნიშვნელობა.

print("goa")
print("goa")
print("goa")
print("goa")
print("goa")

print(10)
print(10)
print(10)
print(10)
print(10)

print(5.5)
print(5.5)
print(5.5)
print(5.5)
print(5.5)

# 5) შექმენით 5 სხვადასხვა ცვლადი. ცვლადებში შეინახეთ თქვენთვის სასურველი მნიშვნელობები და შემდეგ
#  დაბეჭდეთ ერთი დიდი წინადადება ერთი print() ფუნქციის მეშვეობით.

name1= "me"
name2= "var"
name3= "goas"
name4= "axali"
name5= "wevri"

print(name1, name2, name3, name4, name5)

# 6) გააკეთეთ 3-3 მაგალითი ყველა მათემატიკურ ოპერაციებზე.

print(10-5)
print(20-10)
print(30-20)

print(10+5)
print(20+10)
print(30+20)

print(10/5)
print(20/10)
print(25/5)

print(10*5)
print(20*10)
print(25*5)

# 7) შექმენით სამი ცვლადი num1, num2 და num3, შემდეგ კი დაპრინტეთ მათი ჯამი termian-ში.

num1= 15

num2= 35

num3= 20

print(num1 + num2 + num3)




