# 2) კომენტარებით ახსენით რა არის სია და როგორ უნდა შევქმნათ ის python-ში.

# 3) კომენტარებით ახსენით რა არის index-ი.

# 4) შექმენით 7 ელემენტიანი სახელების სია, შეცვალეთ 1-ლი და მე-5 ინდექსზე მდგომი ელემენტების მნიშვნელობა.

# 5) შექმენით სია და შეიტანეთ შიგნით სხვადასხვა ელემენტები და გამოიტანეთ მე-2 ,მე-4 და მე-6 ელემენტები და ახსენით როგორ გამოგაქვთ.

# 6) კომენტარებით ახსენით ასევე განსხვავება list-ს და ცვლადს შორის.

#პასუხები------------------------------------------------------------------------------

# 2) სია (list) არის მონაცემთა ტიპი, რომელიც ინახავს რამდენიმე მნიშვნელობას ერთად.
# სიის შექმნა python-ში, ხდება კვადრატული ფრჩხილებით [].

# 3) Index-ი არის ელემენტის პოზიცია სიაში.
# Python-ში index-ები იწყება 0-დან.
# ანუ:
# 0 -> პირველი ელემენტი
# 1 -> მეორე ელემენტის
# 2 -> მესამე ელემენტი 

# 4) 7 ელემენტიანი სახელების სია
names = ["Nika", "Gio", "Luka", "Saba", "Ana", "Mari", "Dato"]

names[1] = "Andria"

names[5] = "Elene"

print(names)



# 5) სხვადასხვა ელემენტების სია
mixed_list = ["Hello", 25, True, 9.5, "Python", 100, False]


print(mixed_list[1])

print(mixed_list[3])

print(mixed_list[5])

# ელემენტები გამოგვაქვს index-ის დახმარებით.
# რადგან index იწყება 0-დან:
# mixed_list[1] -> მეორე ელემენტი
# mixed_list[3] -> მეოთხე ელემენტი
# mixed_list[5] -> მეექვსე ელემენტი



# 6) განსხვავება list-სა და ცვლადს შორის

# ცვლადი ინახავს მხოლოდ ერთ მნიშვნელობას
name = "Saba"

# list ინახავს რამდენიმე მნიშვნელობას ერთად, და შეგიძლია ცალკ-ცალკე გამოიტანო სიაში ყოველი მონაცემი
names = ["Saba", "Nika", "Luka"]

