# 2) მოცემულია რიცხვების სია. გამოიყენეთ slicing-ის ბიჯი (step), რათა სიიდან ამოიღოთ ყოველი მეორე რიცხვი.
# -- numbers_step = [5, 10, 15, 20, 25, 30, 35, 40] --

# 3) მოცემულია ხილის სია. გამოიყენეთ slicing, რათა ამოჭრათ და მიიღოთ მხოლოდ შუაში მყოფი 3 ხილი.
# -- fruits = ["ვაშლი", "მსხალი", "ატამი", "ბალი", "ყურძენი", "ბანანი", "ფორთოხალი"] --

# 4) მოცემული გაქვთ რიცხვების სია. თქვენი დავალებაა for ციკლისა და if პირობის გამოყენებით სიაში იპოვოთ და დაბეჭდოთ მხოლოდ ლუწი (even) რიცხვები.
# -- mixed_nums = [12, 45, 8, 33, 91, 24, 10, 77] --

# 5) კომენტარების დახმარებით ახსენით თუ რა არის ფუნქციები და რა დანიშნულება გააჩნიათ.

# 6) კომენტარების დახმარებით ახსენით თუ რა არის ფუნქციების არგუმენტები, მოიყვანეთ მაგალითები.

# 7) გააკეთეთ მაგალითები .lower() და .upper() ფუნქციებზე.

#პასუხები--------------

# 2) ყოველი მეორე რიცხვის ამოღება slicing-ის step-ის გამოყენებით

numbers_step = [5, 10, 15, 20, 25, 30, 35, 40]

print(numbers_step[::2])


# 3) შუაში მყოფი 3 ხილის ამოჭრა

fruits = ["ვაშლი", "მსხალი", "ატამი", "ბალი", "ყურძენი", "ბანანი", "ფორთოხალი"]

print(fruits[2:5])


# 4) მხოლოდ ლუწი რიცხვების დაბეჭდვა

mixed_nums = [12, 45, 8, 33, 91, 24, 10, 77]

for i in mixed_nums:
    if i % 2 == 0:
        print(i)


# 5) 
# ფუნქცია არის კოდის ელემენტი, რომელიც ასრულებს კონკრეტულ დავალებას.
# მისი გამოყენებით შეგვიძლია ერთი და იგივე კოდი მრავალჯერ გამოვიყენოთ.


# 6)
# არგუმენტები არის მნიშვნელობები, რომლებსაც ფუნქციას გადავცემთ.
# ისინი ფუნქციას ეხმარება იმუშაოს სხვადასხვა მონაცემებზე.

# მაგალითები:
print("გამარჯობა")   
print(100)          


# 7) 

text = "Hello World"

print(text.lower())
print(text.upper())  