# 2) მომხმარებელს შემოაყვანინე სამი რიცხვი, ხოლო პროგრამამ დაბეჭდოს მათი საშუალო არითმეტიკული.

# 3) მომხმარებელს შემოატანინე ორი რიცხვი და დაბეჭდე მათი ჯამი.

# 4) input ფუნქციის საშუალებით შემოიყვანეთ თქვენი და თქვენი ოჯახის წევრების სახელები და დაპრინტეთ ერთი დიდი წინადადება კონკატენაციის სახით.

# 5) მომხმარებელს შემოატანინეთ მისი ქალაქის, უბნის, კორპუსის და სართულის შესახებ ინფორმაცია (რომლებიც უნდა შეინახოთ ცალ-ცალკე ცვლადებში). 
# მაგ. city = "Tbilisi", District = "{თქვენი უბანი}" და ა.შ. საბოლოოდ print() ბრძანების საშუალებით ტერმინალში გამოიტანეთ მომხმარებლის სრული მისამართი.

# 6) მომხმარებელს შემოატანინეთ ასაკი და ამოყენებითმსგავსი ფორმატის წინადადება: 
# "You are ასაკი years old".

num_1 = float(input("please enter a number: "))
num_2 = float(input("please enter a number: "))
num_3 = float(input("please enter a number: "))

average = (num_1 + num_2 + num_3)/3

print(average)
