# 6) გააკეთეთ 3-3 მაგალითი logical operator-ებზე
# 7)მომხმარებელს შემოატანინეთ რიცხვი, შეინახეთ იგი ცვლადში და შეადარეთ იგი მეტია თუ არა თქვენს მიერ წინასწარ გამზადებულ რიცხვზე
# 8)კომენტარების სახით ახსენით თუ რაარის for loop და რაში ვიყენებთ მას 
# 9)კომენტარების სახით ახსენით თუ რა განსხვავებაა for loop სა და while loop შორის 
# 10)დაატრიალეთ for ციკლი 0 დან 64 ის ჩათვლით და გამოიტანე თითოეული რიცხვი ტერმინალში

#6)

#and

print(7 > 2 and 8 < 3)
print(3 > 1 and 6 > 2)
print(5 < 9 and 4 < 2)

#or

print(7 > 2 or 8 < 3)
print(3 > 1 or 6 > 2)
print(5 < 9 or 4 < 2)



#7)

num_1 = int(input("insert number here: "))

result = 18 < num_1

print(result)


#8)
#For loop ვიყენებთ როდესაც ვიცით რამდენჯერ უნდა შესრულდეს ჩვენი კოდი 

#While loop ვიყენებთ როდესაც არ ვიცით რამდენჯერ უნდა შესრულდეს ჩვენი კოდი 

#10)
for i in range(65):
    print(i)
 