# 2) კომენტარების სახით ჩამთვალეთ ყველა შედარებითი ოპერატორები და გააკეთეთ 5-5 ნაგალითი თითოეულზე.

# 3) კომენტარების სახით ახსენით რა არის logical operators, ჩამოწერეთ თითოეული და განმარტეთ რომელი რა დროს რა შედეგს გვიბრუნებს.

# 4) გააკეთეთ 3-3 მაგალითი logical operator-ებზე.

# 5) მომხმარებელს შემოატანინეთ რიცხვი, შეინახეთ იგი ცვლადში და შეადარეთ იგი მეტია თუ არა თქვენს მიერ წინასწარ გამზადებულ რიცხვზე.

# 6) მომხმარებელს შემოატანინეთ სახელი, შეინახეთ იგი ცვლადში და მკაცრად შეამოწმეთ უდრის თუ არა იგი თქვენს სახელს.

# 7) მომხმარებელს შემოატანინეთ თავისი ასაკი, შეინახეთ იგი ცვლადში და შეამოწმეთ მეტია თუ არა იგი 18.

#-------------------

#2) 

# ==
print(5 == 5)
print(3 == 7)
print(7 == 10)
print(2 == 8)
print(9 == 9)

# !=
print(4 != 5)
print(8 != 8)
print(3 != 0)
print(2 != 5)
print(5 != 10)

# >  
print(10 > 7)   
print(5 > 8)
print(4 > 2)
print(3 > 9)
print(6 > 4)

# <
print(3 < 2)    
print(8 < 1)
print(9 < 7)
print(8 < 5)
print(3 < 0)

# >= 
print(5 >= 5)  
print(3 >= 7)
print(1 >= 5)
print(3 >= 9)
print(2 >= 4)

# <=
print(4 <= 4)   
print(5 <= 2) 
print(6 <= 3)
print(9 <= 0)
print(10 <= 5)

#--------------

#3)
# Logical operators გამოიყენება სიმართლეს (True) და ტყუილს (False) გადასამოწმებლად. logical operator-ებია: and, or

# 1) and, აბრუნებს True თუ ორივე პირობა True
# 2) or,    აბრუნებს True თუ მინიმუმ ერთი პირობა True

#--------------

#4)

print(True and True)    
print(True and False)
print(False and False)

print(True or True)
print(True or False)
print(False or False)

