# 1)კომენტარების სახით ახსენიტ თუ რაარის for loop და რაში ვიყენებთ მას
# 2)კომენტარის სახით ახსენით თუ რა გადაეცემა range() ფუნქციას და როგორ მუშაობს for loop
# 3)დაატრილეთ for ციკლი 30 დან 40 მდე და გამოიტანე თითოეული რიცხვი ტერმინალში
# 4)დაატრიალეთ for ციკლი 10 დან 100 მდე 3 step ის გამოტოვებით და გამოიტანეთ თითოეული რიცხვი ტერმინალში
# 5)მომხმარებელს შემოატანინეთ მისი ასაკი 13 ჯერ გამოიყენე for loop
# 6)კომენტარების სახიტ ახსენიტ თუ რაარის if,else,elif
# 7)კომენტარების სახიტ ახსენიტ თუ რაარის input() და რაში ვიყენებთ მას
# 8)მომხმარებელს შემოაყვანინეთ რიცხვი, შემდეგ შეამოწმეთ თუ ეს რიცხვი უდრის 15 ს დაუპრინტეთ "equal to 15" სხვა შემთხვევაში დაუპრინტეთ "not equal to 15"
# 9)მომხმარებელს შემოაყვანიეთ თავისი ასაკი:
# 0–12 წლის ასაკი --> დაპრინტეთ 'ბავშვი ხარ'
# 13-19 წლის ასაკი --> დაპრინტეთ 'მოზარდი/თინეიჯერი ხარ'
# 20-64 წლის ასაკი --> დაპრინტეთ 'ზრდასრული ხართ'
# 65-120 წლის ასაკი --> დაპრინტეთ 'ხანში შესული ხართ'
# 120 და ზემოთ --> დაპრინტეთ 'გურუ ან ჯადოქარი'
# თუ შემოყვანილი ასაკი უარყოფითია --> დაპრინტეთ 'არასწორი ინფო'
# 10)კომენტარებით ახსენით რა არის სია და როგორ უნდა შევქმნათ ის python-ში
# 11)კომენტარების სახით ახსენით თუ რაარის index

#პასუხები-------------------------------------------

#1) loop პითონში ნიშნავს ციკლს, loop-ის დახმარებით ჩვენ შეგვიძლია, იგივე პირობა, უსასრულოდ გამოვიტანოთ

#2) range() ფუნქცია, განსაზვრავს, საიდან სადამდე, და რამდენი ადგილის გამოტოვებიტ დაიბეჭდება პირობა, for loop რომ ვამუშაოთ, მას უნდა გადავცეთ
# range() და მივუთითოთ რამდენჯერ გვინდა პირობის დაპრინტვა

#3) 
for i in range(30, 41):
    print(i)

#4)
for d in range(10, 101, 3):
    print(d)

#5)
for a in range(13):
   agee = int(input("enter you age here: "))

#6) როდესაც ჩვენ ვიყენევთ if-ს, ჩვენ ვამოწმებთ მთავარ პირობას, ჩემდეგ დანარჩენ, ნაკლებად საჭირო პირობას, elif-ით, და დანარჩენ სხვა პირობას, else-ით

#7) input()-თით, ჩვენ მომხმარებელს შემოვატანინებთ რაიმეს, მაგალითად, input("enter your name: ")

#8)
age = int(input("enter your age here: "))

if age == 15:
    print("equal to 15")
else:
    print("not equal to 15")

#9)
user_age = int(input("enter your age: "))

if user_age < 12:
    print("ბავშვი ხარ")
elif user_age < 0:
    print("არასწორი ინფო")
elif user_age <= 19:
    print("მოზარდი/თინეიჯერი ხარ")
elif user_age <=64:
    print("ზრდასრული ხართ")
elif user_age <= 120:
    print("ხანში შესული ხართ")

else:
    print("გურუ ან ჯადოქარი ხარ")

#10) სია არის მონაცემთა ტიპი, მასში ინახება პირობები. პითონში სია იქმნება კვადრატული ფრჩხილებით[]

#11) index არის სიაში ელემენტების ნომერი, ანუ list-ში