# 2) ლოგიკური ოპერატორებისა და შედარების ოპერატორებზე შეადგინეთ 10 მაგალითი,5 მაგალითმა უნდა დააბრუნოს False და 5 მაგალითმა უნდა დაააბრუნოს True
 
# 3) კომენტარის სახით დაწერეთ თუ რა არის sequancing,iteration,selection აღწერე თითეული მათგანი თქვენი სიტყვებით

# 4) მოიყვანე sequencing ის მაგალითი,და კომენტარით მიუწერე რატომ არის შენს მიერ მოყვანილი მაგალითი sequence

# 5) კომენტარის სახით ახსენით თუ რა არის for loop და რაში გვეხმარება ის

# 6) კომენტარის სახით ახსენით თუ რა გადაეცემა range() ფუნქციას და როგორ მუშაობს for loop

# 7) შენი დავალებაა ტერმინალში გამოიყანო საყვარელი ავტომობილის სახელი ტერმინალში გამოიყენე for loop

# 8) შენი დავალებაა ტერმინალში გამოიტანო შენი გვარი 100 ჯერ

# 9) შენი დავალებაა ტერმინალში გამოიტანო საყვარელი ფერი 46 ჯერ

# 10) შენი დავალებაა ტერმინალში გამოიტანო შენი სახელის პირველი ასო 32 ჯერ


# # გამეორება / Revise -->

# 11) მომხმარებელს შემოატანინე 3 სტრინგ ტიპის და ერთი ინტეჯერ ტიპის მნიშვნელობები და შენი დავალებაა მოახდინო ამ ოთხი მნიშვნელობის კონკატინაცია(გამოიყენე შესაბამისი ფუნქცია რომ მოახდინოთ მონაცემთა ტიპიების გარდაქმნა ერთ მონაცემთა ტიპში რომ შეძლოთ კონკატინაცია)

# 12) შექმენი 4 ცვლადი,თითოეულში შეინახე განსხვავებული მონაცემთა ტიპები,შენი დავალებაა გაიგო ამ ცვლადებში შენახული მნიშვნელობის მონაცემთა ტიპი(გამოიყენე შესაბამისი ფუნქცია)

# 13) მომხმარებელს შემოატანინე 4 რიცხვი და ტერმინალში დააბრუნე ამ 4 რიცხვის ჯამი


#პასუხები-------------------------------

#2)

print(5 > 3)           
print(10 == 10)       
print(7 != 2)         
print(8 >= 8)         
print(2 < 5 and 3 < 6)  

print(4 < 2)          
print(9 == 5)        
print(6 <= 3)         
print(10 != 10)       
print(5 > 3 and 2 > 4) 

#3)

# Sequencing - ნიშნავს რომ კოდი სრულდება ზემოდან ქვემოთ და ნაბიჯ-ნაბიჯ.

# Iteration - ნიშნავს გამეორებას, ანუ ერთი და იგივე კოდის რამდენჯერმე შესრულებას 

# Selection - ნიშნავს არჩევანს, ანუ პროგრამა წყვეტს რა გააკეთოს გარკვეული კოდის მიხედვით

#4)

print("Hello")
print("World")
print("Python")

# ეს არის sequencing, რადგან კოდი სრულდება ზუსტად იმ რიგით, ნებისმიერი კოდის დაწერის დროს სრულდება seqncing

#5)

# for loop არის ციკლი, რომელიც გვაძლევს საშუალებას ერთი და იგივე კოდი გავიმეოროთ რამდენჯერმე ავტომატურად და არ მოგვიწიოს მისი ბევრჯერ დაწერა

#6)

# range() ფუნქციას გადავცემთ რიცხვებს:
# range(start, stop, step)

# start - საიდან დაიწყოს
# stop - სადამდე მივიდეს
# step - რამდენით გაიზარდოს

# for loop იღებს range()-დან მნიშვნელობებს და ანხორციელებს მას

#7)

for i in range(5):
 print("toyota")


#8)

for p in range(100):
 print("Batiashvili")

#9)

for f in range(46):
 print("orange")
 
#10)

for a in range(32):
 print("S") 

#გამეორება----------

#11)

a = input("Enter string 1: ")
b = input("Enter string 2: ")
c = input("Enter string 3: ")
d = int(input("Enter integer: "))

winadadeba = a + b + c + str(d)
print(winadadeba)

#12)

a = "Hello"
b = 10
c = 3.14
d = True

print(type(a))
print(type(b))
print(type(c))
print(type(d))

#13)

a = int(input("Enter number 1: "))
b = int(input("Enter number 2: "))
c = int(input("Enter number 3: "))
d = int(input("Enter number 4: "))

sum = a + b + c + d
print(sum)