# 2) კომენტარებით ახსენით თუ რა არის custom ფუნქციები, რისთვის გამოვიყენებთ და რა დანიშნულება გააჩნიათ, ასევე ახსენით მისი შექმნის გზები ეტაპობრივად და ახსენეთ თუ რაა პარამეტრები და არგუმენტები.

# 3) შექმენით ფუნქცია, რომელსაც გადაეცემა ორი რიცხვი. თქვენი დავალებაა დააბრუნოთ ამ ორი რიცხვის ჯამი.

# 4) შექმენით ფუნქცია, რომელსაც გადაეცემა 1 რიცხვი. თქვენი დავალებაა შეამოწმოთ ამ რიცხვის ლუწობა. თუ იგი ლუწია, დაბეჭდეთ "რიცხვი ლუწია" სხვა შემთხვევაში "რიცხვი კენტია"

# 5) შექმენით ფუნქცია, რომელსაც გადაეცემა 1 რიცხვი. თქვენი დავალებაა დააბრუნოთ ამ რიცხვის კვადრატული მნიშნელობა.

# 6) შექმენით ფუნქცია, რომელიც გადაცემულ ტექსტს აბრუნებს დიდი ასოებით.

# 7) შექმენით ფუნქცია, რომელსაც პარამეტრებად გადაეცემა სახელი და გვარი, თქვენი დავალებაა გამოიტანოთ მნიშვნელობები ერთი წინადადების სახით.

#პასუხები-------------------------------------------------------------

# 2)
# Custom ფუნქციები არის ჩვენს მიერ შექმნილი ფუნქციები ისინი გამოიყენება იმისთვის, რომ ერთი და იგივე კოდი ბევრჯერ არ დავწეროთ.
# ფუნქცია კოდს უფრო ამარტივებს და უფრო გასაგებს ხდის.

# ფუნქციის შექმნის ეტაპებია:
# 1. ვწერთ key word def
# 2. ვაძლევთ ფუნქციას სახელს (ნებისმიერი სახელი შეიძლება)
# 3. ფრჩხილებში ვწერთ ამ სახელს
# 4. ვამატებთ :
# 5. ვიძახებთ ფუნქციას, იმ სახელით რაც მივეცით და გადავცემთ არგუმენტებს

# არგუმენტი (Argument) - რეალური მნიშვნელობაა, რომელსაც ფუნქციის გამოძახებისას გადავცემთ.


# 3)
def sum_numbers(num1, num2):
    return num1 + num2

print(sum_numbers(10, 20))


# 4) 

def even_or_odd(number):
    if number % 2 == 0:
        print("რიცხვი ლუწია")
    else:
        print("რიცხვი კენტია")

number = int(input("შეიყვანე რიცხვი: "))
even_or_odd(number)


# 5)
def square(number):
    return number ** 2

number = int(input("შეიყვანეთ რიცხვი: "))

print(square(number))


# 6)
def to_upper(text):
    return text.upper()

text = (input("შეიყვანეთ თქვენი ტექსტი: "))

print(to_upper(text))

