#  1) გააკეთეთ თითო მაგალითი თითო მათემატიკურ ოპერატორზე.

#  2) შექმენით 3 ცვლადი -->
# პირველ ცვლადში შეინახეთ ინფორმაცია თქვენი სახელის შესაახებ.

# მეორე ცვლადში შეინახეთ ინფორმაცია თქვენი ასაკის შესახებ.

# მესამე ცვლადში შეინახეთ ინფორმაცია თქვენი საყვარელი ფერის შესახებ.

# main task: ააგეთ ერთი დიდი წინადადება ცვლადების დახმარებით როგორც გაკვეთილზე მაგალითის სახით გავაკეთეთ.



a= 5

b= 10

print(a + b)

name1="saba"

age = 14

color = "orange"

print(name1  ) 


word1= "Hello"

word2= "Saba"

word3= "How are you?"

print(word1 , word2 , word3)