# 1)კომენტარების სახით ახსენით თუ რაარის custom function ები

# 2)კომენტარების სახით ახსენით თუ რა დანიშნულება აქვთ .append(); .insert() და .pop() ფუნქციებს

# 3)კომენტარებით ახსენით თუ რას აკეთებს .upper(); .lower(); .capitalize(); .find(), .count(), len(), .endswith(), .startswith() ფუნქციები

#პაუხები---------------------------------------------


# 1) costum function, ანუ ჩვენს მიერ შექმნილი ფუნქცია, არის ფუნქცია რომელიც გვეხმარება კოდის ადვილად დაწერაში, ის იქმნება key word def-ით

# 2) .append() ფუნქცია ამატებს ელემნტს სიის ბოლოში, insert() ფუნქციით შეგვიძლია ელემნტი კონკრეტულ სიის ინდექსში ჩავსვათ, pop() ფუნქცია შლის ჩვენ 
# მითითებულ ელემნტს სიიდან

# 3) .upper() ამაღლებს ასოების რეგისტრს, .lower() ადაბლებს ასოების რეგისტრს, .capitalize() მხოლოდ პირველ ასოს მაღალ რეგისტრში იყვანს, 

# find() ეძებს თუ სად მეორდება ელემენტები count() ითვლის კონკრეტული ელემენტების რაოდენობას, len() ლისტის სიგრძეს იგებს,

# .startswith() თუ იწყება რაიმე სიმბოლოთი გამოგვიტანთ true ან false, endswitch თუ მთავრდება რაიმე სიმბოლოთი გამოგვიტანთ true ან false