# 1) მომხმარებელს შემოატანინეთ input-ის მეშვეობით თავისი სახელი, შეინახეთ იგი ცვლადში და ბეჭდეთ მიღებული მნიშვნელობა.

# 2) მომხარებელს შემოატანინეთ 2 ცალი რიცხვი სხვადასხვა დამოუკიდებელი input-ის მეშვეობით, ამის შემდეგ კი უბრალოდ დაბეჭდეთ ამ შემოყვანილი რიცხვების ჯამი. 

# (დაგჭირდებათ int() ფუნქცია)

# 3) მომხმარებელს შემოატანინეთ თავისი ასაკი, თქვენი დავალებაა შემოყვანილი მნიშვნელობა გადაიყვანოთ integer ტიპის მონმაცემად და საბოლოოდ დაბეჭდოთ მომხმარებლის 
 
# მიერ შემოყვანილი მნიშვნელობის მონაცემთა ტიპი.

# 4) შექმენით 3 ცვლადი, თითოულ ცვლადში შეინახეთ 1 მონაცემთა ტიპის მნიშვნელობა, თქვენი დავალებაა კი საბოლოოდ დაბეჭდოთ ამ ცვლადების მონაცემტა ტიპები.



#1)
name = input("insert name here: ")

print(name)

#2) 

num_1 = input("insert num here: ")

num_2 = input("insert name heree: ")

print(num_1 + num_2)

#3)

num = (int(input("insert num here")))

print(type(num))

#4)

num = str(10)

name = "saba"

num_1 = str(1.0)

print(num + name + num_1)








