# 1)კომენტარების აახით ახსენით თუ რაარის print() და რასაკეთებს ის 
# 2)კომენტარების სახუთ ახსენით თუ რაარის terminal და რაში ვიყენებთ მას
# 3)ჩამოთვალეთ რამდენი მომაცემთა ტიპი გვაქვს პითონში 
# 4)კომენტარების სახით ახსენით თუ რაარის input და output 
# 5)input ის მეშვეობით მომხმარებელს შემოატაინეთ რიცხვები შემდეგ ეგ შემოტანილი მნიშვნელობები შეინახეთ ცვალდებში და შეასრულეთ შემდეგი მათემატიკური ოპერაციები +,-,*,/ და საბოლოო შედეგები დაბეჭდეთ ტერმინალში
# 6)გაასწორეთ ამ კოდში შეცდომები:
# name = “GOA”
# print(namme)

# City = Tbilisi
# print(“City”)


# პასუხები:


# 1) print ფუნქციით ჩვენ პრინტში ჩაწერილ ტექსტი გაგვაქვს ტერმინალში

# 2) terminal არის ის ადგილი, სადაც ჩვენი დაპრინტული ინფორმაცია მიდის

# 3) პითონში არის 4 მონაცემთა ტიპი: string(str), integer(int), float, boolean(bool)

# 4) input ნიშნავს როდესაც კომპიუტერს რაღაცა ინფორმაციას ვაწვდით, მაგ. კლავიატურა, და output ნიშნავს როდესაც კომპიუტერი რაღაცა ინფორმაციას გვაწვდის, მაგ. სპიკერი

# 5) 

num_1 = int(input("insert number here: "))

num_2 = int(input("insert number here: "))

print(num_1 + num_2)

print(num_1 - num_2)

print(num_1 / num_2)

print(num_1 * num_2)

# 6)

#1) name = “GOA”
# print(namme)

name = "GOA"

print(name)

#2) City = Tbilisi
# print(“City”)

City = "Tbilisi"

print(City)








