# 1)კომენტარების სახით ახსენით რაარის print() და რაში გამოვიყეებთ მას 
# 2)კომენტარების სახით ახსენით რომელი მონაცემთა ტიპებია integer float string
# 3)კომენტარების სახით ახსენით რაარის ცვლადი და რაში გამოვიყნებთ მას 
# 4)შექმენი 3 ცვლადი ერთი შეინახეთ თქვენი სახელი მეორეში ასაკი და მესამეში თქვენი ქალაქი სა საბოლოოდ დაბეჭდეთ ეგ ცვალდები ტერმინალში 
# 5)გააკეთეთ 2 ორი მაგალითი ყველა მათემატიკურ ოპერატორზე და საბოოლო შესეგი დაბეჭდეთ ტერმინალში
# 6)კომენტარების სახით ახსენით რაარის debugging
# 7)კომენტარების სახით ახსენით რაარის syntax
# 8)კომენტარების სახით ახსენით თუბრაარის error

# 1) print() ფუნქციით ჩვენ შეგვიძლია დავბეჭდოთ ჩვენი სასურველი მესიჯი
# 2) integer- ინტეგერი არის წარმოდგენილი როგორც მთელი რიცხვი, ანუ მაგალითად (10)  
#  float- ფლოუთი არის წარმოდგენილი როგორც ათწილადი, ანუ მაგალითად (1.0)    
#  string- სტრინგი, წინა ორი მონაცემთა ტიპისგან განსხვავებით, არის სიტყვიერად წარმოდგენილი, 
#  მაგალითად ("hello world"), სტრინგში ასევე ჩვენ გვჭირდება რომ გამოვიყენოთ ("") რომ სწორად დაიბეჭდოს
# 3) variable, ანუ ცვლადი, არის რაღაც სადაც შეგვიძლია ინფორმაცია შევინახოთ, მაგალითად name = "goa"
# 4)
name = "saba"

age = 14

city = "Tbilisi"

print(name, age, city)

# 5)
print(10+5)
print(20+5)

print(10-5)
print(20-5)

print(10*5)
print(20*5)

Print(10/5)
print(20/5)

print(25%7)
print(30%4)

# 6) debugging, არის ერთ ერთი ნაბიჯი კოდის გააშვების ციკლში, debugging-ის დროს, კომპიუტერი 
# პოულობს ხარვეზებს, და ასწორებს მას
# 7) syntax, ნიშნავს ენის იმ გრამატიკულ წესებს, რაც უნდა დავიცვათ, პროგრამირებაშიც ასეა, 
# აქაც უნდა დავიცვათ იმ პროგრამის გრამატიკული წესები, თორემ ჩვენი კოდი არ იმუშავებს
# 8) error, არის შეცდომა, error არის ის კოდის ნაწილი, რასაც კომპიუტერი ვერ კითხულობს
