# 2) კომენტარების სახით ახსენით რა არის input-ი და output-ი, მოიყავნეთ შესაბამისი მაგალითები.

# 3) შექმენით ცვლადი, რომელშიც შეინახავთ input ინსტრუქციით შემოტანილ მნიშვნელობას, შემდეგ შეამოწმებთ თუ რა ტიპის მონაცემი ინახება ამ ცვლადში და დაპრინტავთ.

# 4) თიოთეული მონაცემთა ტიპისთვის (str,int,float), შექმენით 5 ცვლადი და დაუწერეთ კომენტარი თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი.

# 5) აიღეთ 3 ცვლადი, შეინახეთ განსხავებული მონაცემთა ტიპები (str,int,float), შემდეგ type ინსტრუქციის გამოყენებით შეამოწმეთ, თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი.

# 6) მომხმარებელს შემოატანინეთ ორი სიტყვა, შეინახეთ ისინი ცვლადებში, მოახდინეთ მათი კონკატინაცია და დაბეჭდეთ.

# 7) მომხმარებელს შემოატანინეთ 5 რიცხვი სხვადასხვა დამოუკიდებელი input-ების სახით, თქვენი დავალებაა დაბეჭდოთ მათი საშუალო არითმეტიკული.

# 8) მომხმარებელს შემოატანინეთ სახელი, გვარი, ასაკი, სიმაღლე, წონა და ამ მონაცემების გამოყენებით დაბეჭდეთ ერთი დიდი წინადადება.

# პასუხები

#2)

#input - ინფუთი არის ინფორმაცია რასაც პროგრამას გადავცემთ, მაგალითად ჩვენი მიკროფონი ან კლავიატურა და მაუსი
#output- აუთფუთი ნიშნავს ინფორმაციას რასაც პროგრამა გამოსცემს, მაგალითად სპიკერი ანდ მონიტორი

#3)

name = input("insert generic name here: ")

print(type(name))

#4)

#str

name_1 = "goa"
name_2 = "goa"
name_3 = "goa"
name_4 = "goa"
name_5 = "goa"

#int

num_1 = 10
num_2 = 10
num_3 = 10
num_4 = 10
num_5 = 10

#float

flt_1 = 1.0
flt_2 = 1.0
flt_3 = 1.0
flt_4 = 1.0
flt_5 = 1.0

print(type(name_1))
print(type(name_2))
print(type(name_3))
print(type(name_4))
print(type(name_5))

print(type(num_1))
print(type(num_2))
print(type(num_3))
print(type(num_4))
print(type(num_5))

print(type(flt_1))
print(type(flt_2))
print(type(flt_3))
print(type(flt_4))
print(type(flt_5))








