# 2) შექმენით ცვლადი სადაც შეინახავთ integer ტიპის მონაცემს, შემდეგ შეამოწმეთ თუ ეს რიცხვი რომელიც ცვლადში გაქვთ შენახული მეტია 10 ზე დაპრინტეთ "more than 10" სხვა შემთხვებაში დაპრინტეთ "less than 10"

# 3) მომხმარებელს შემოაყვანინეთ რიცხვი, შემდეგ შეამოწმეთ თუ ეს რიცხვი უდრის 15 ს დაუპრინტეთ "equal to 15" სხვა შემთხვევაში დაუპრინტეთ "not equal to 15"

# 4) მომხმარებელს შემოატანეთ სტრინგი. შენი დავალებაა შეამოწმო, თუ მომხამრებლის მიერ შემოყვანილი სტრინგი არის group92 დაუპრინტეთ 'you are correct" სხვა შემთხვევაში დაუპრინტეთ "you are wrong"# 5) დაატრიალეთ for ციკლი 50 დან 100 მდე 5 ის გამოტოვებით# 6) for ციკლის დახმარებით გამოიტანეთ ტერმინალში თქვენი სახელი და გვარი# 7) while loop ის დახმარებით ტერმინალში გამოიტანეთ რიცხვები 20 დან 50 მდ

#პასუხები----------
# 2)
num = 12

if num > 10:
    print("more than 10")
else:
    print("less than 10")


# 3)
num = int(input("შეიყვანე რიცხვი: "))

if num == 15:
    print("equal to 15")
else:
    print("not equal to 15")


# 4)
text = input("შეიყვანე სტრინგი: ")

if text == "group92":
    print("you are correct")
else:
    print("you are wrong")



