# 5) დაატრიალეთ for ციკლი 50 დან 100 მდე 5 ის გამოტოვებით

# 6) for ციკლის დახმარებით გამოიტანეთ ტერმინალში თქვენი სახელი და გვარი

# 7) while loop ის დახმარებით ტერმინალში გამოიტანეთ რიცხვები 20 დან 50 მდე

# 8) დაბეჭდეთ 0-დან 100-მდე ყველა რიცხვი. (for-თაც და while-თაც)

# 5)
for i in range(50, 101, 5):
    print(i)


# 6)
for i in range(1):
    print("საბა ბატიაშვილი")


# 7)
i = 20
while i <= 50:
    print(i)
    i += 1
    
# 8)
for i in range(0, 101):
    print(i)

i = 0
while i <= 100:
    print(i)
    i += 1